# Ultralytics ?? AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 4 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  m: [0.50, 1.00, 512] # summary: 292 layers, 20,199,168 parameters, 20,199,152 gradients, 68.1 GFLOPs
  n: [0.50, 0.25, 1024] # summary: 272 layers, 2,602,288 parameters, 2,602,272 gradients, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 272 layers, 9,284,096 parameters, 9,284,080 gradients, 21.7 GFLOPs
  
  l: [1.00, 1.00, 512] # summary: 488 layers, 26,450,784 parameters, 26,450,768 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 488 layers, 59,210,784 parameters, 59,210,768 gradients, 200.3 GFLOPs

ch: 4

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]

  - [-1, 1, Silence, []]  # 0-P1/2             0
  # visible
  - [0, 1, SilenceChannel, [0,3]]  # 0-P1/2    1
  - [-1, 1, Conv, [64, 3, 2]] # 2-P1/2         2
  # depth
  - [0, 1, SilenceChannel, [3,4]]  # 11-P1/2   3
  - [-1, 1, Conv, [64, 3, 2]] # 12-P1/2        4
  
  
  - [ [ 2, 4], 1, ADD, [64] ]       # 5
  
  - [2, 1, Conv, [128, 3, 2]] # 3-P2/4       
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8        
  - [-1, 2, C3k2, [512, False, 0.25]]          #9
  
  - [4, 1, Conv, [128, 3, 2]] # 3-P2/4       
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8        
  - [-1, 2, C3k2, [512, False, 0.25]]          #13
  
  - [ [ 9, 13], 1, FourierBlock, [512] ]       # 14  FourierBlock
  
  # visible
  - [9, 1, Conv, [512, 3, 2]] # 7-P4/16         
  - [-1, 4, A2C2f, [512, True, 4]]        #16
  

  - [13, 1, Conv, [512, 3, 2]] # 7-P4/16         
  - [-1, 4, A2C2f, [512, True, 4]]           #18
  
  - [ [ 16, 18], 1, FourierBlock, [512] ]       # 19  FourierBlock

  # visible
  - [16, 1, Conv, [1024, 3, 2]] # 9-P5/32        
  - [-1, 4, A2C2f, [1024, True, 1]] # 10         21
  
  - [18, 1, Conv, [1024, 3, 2]] # 9-P5/32        
  - [-1, 4, A2C2f, [1024, True, 1]] # 10         23
  
  - [ [ 21, 23], 1, FourierBlock, [1024] ]       # 24  FourierBlock
  
  

# YOLO12n head
head:

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]             #25
  - [[-1, 19], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 23                   27

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]             #
  - [[-1, 14], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 26                    30


  - [-1, 1, Conv, [256, 3, 2]]                               #
  - [[-1, 27], 1, Concat, [1]] # cat head P4                  
  - [-1, 2, A2C2f, [512, False, -1]] # 38                     33

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 24], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 41 (P5/32-large)            36


  - [ [5, 30], 1, DFF, [256]]     # 37
  - [ [5, 33], 1, DFF, [512]]     # 38
  - [ [5, 36], 1, DFF, [1024]]    # 39
  
  
  - [[37, 38, 39], 1, Segment, [nc, 32, 256]] #






